cask_args appdir: "/Applications"

# Tap Homebrew
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

# System
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "mas"
brew "curl"
brew "wget"
brew "git"
brew "openssl"
brew "coreutils"
brew "moreutils"
brew "findutils"
brew "binutils"
brew "rename"
brew "tree"
brew "htop"
brew "pidof"
brew "pstree"
brew "grep"
brew "rsync"
brew "openssh"
brew "ssh-copy-id"
brew "screen"
brew "rlwrap"
brew "sslscan"
brew "exa"

# Images, Audio, Video
brew "gifify"
brew "ffmpeg"

# Dev
brew "ruby"
brew "rustup-init"
brew "node"
brew "n"
brew "yarn"
brew "python"
brew "pyenv"
brew "redis"
brew "jq"
brew "spaceship"

# Ops
brew "kind"
brew "docker-compose"
brew "podman"
brew "helm"
brew "kubernetes-cli"
brew "terraform"
brew "kubectx"
brew "circleci"
brew "awscli"
brew "serverless"

# Casks
cask "visual-studio-code"
cask "sublime-text"
cask "iterm2"
cask "raycast"
cask "bitwarden"
cask "google-chrome"
cask "firefox"
cask "rectangle"
cask "gitup"
cask "trailer"
cask "postman"
cask "wireshark"
cask "gimp"
cask "inkscape"
cask "handbrake"
cask "telegram"
cask "slack"
cask "spotify"
cask "notion"
cask "zoom"
cask "alfred"
cask "vlc"
cask "webtorrent"